// Дан массив. Нужно вывести в консоль количество четных и нечетных элементов в массиве. Если в массиве есть нулевой элемент, то он учитывается и выводится отдельно. 
//При выполнении задания необходимо учесть, что массив может содержать не только числа, но и, например, знаки, null и тд.

// Решение: в первую очередь создаем 3 переменные, которые будем использовать для подсчета четных (even), нечетных (odd) и нулей (zero). Изначально все они равны  нулю. С помощью цикла for перебираем все элементы массива. В первой условной конструкции отсекаем все нечисловые значения (строки, null, NaN), далее проверяем на четность/нечетность/ноль. При выполнении какого-либо из этих условий к соответствующей переменной (even/odd/zero) добавляем + 1. 

const arr = [0, null, NaN, 0, 1, 2, 4, "str"];

let even = 0, 
    odd = 0,
    zero = 0;

for (let i = 0; i < arr.length; i++) {
	if (typeof arr[i] === "number" && !isNaN(arr[i])) {
		if (arr[i] === 0) {
			zero += 1;
		} else if (arr[i] % 2 === 0) {
			even += 1;
		} else {
			odd += 1;
		}
	}
}

console.log("четных элементов: ", even);
console.log("нечетных элементов: ", odd);
console.log("нулей: ", zero);
