// Дан массив. Проверить, одинаковые ли элементы в массиве и вывести результат true или false в консоль. Речь идет не о двух рядом стоящих одинаковых элементах, а обо всех.

// Для выполнения данной задачи нужно объявить флаг (переменная булева типа isEqual), который будет отвечать за то, одинаковые элементы в массиве или нет (true - все одинаковые, false - нет). Флаг изначально выставлен в true. Далее мы объявляем константу reference, в которую записываем первый элемент массива, и проходим по всем элементам, сравнивая их с reference. Если хотя бы один элемент не равен reference, значит, массив не содержит все одинаковые элементы и флаг нужно переставить в false. 

const arr = [1, 2, 3, 3];

let isEqual = true;
const reference = arr[0];

for (let item of arr) {
	if (item !== reference) {
		isEqual = false;
	}
}

console.log(isEqual);