//Дана переменная Х, которая может принимать любое значение. Написать программу, которая в зависимости от типа данных Х выводит в консоль сообщение вида: «X — число».
//Опишите три случая: когда х = числу, строке или логическому типу. В других случаях выводите сообщение: «Тип x не определён».

let valueX = prompt('введи данные');
switch (typeof valueX) {
    case "number":
        alert('X — число');
        break;
    case "string":
        alert('X — строка');
        break;
    case "boolean":
        alert('X — логический');
        break;
    default:
        alert('Тип x не определён');
}

// решение верное, однако в данном случае x лучше не задавать через prompt, потому что по умолчанию все значения, полученные из prompt, являются строками